Revit 2027 API
Form.IsEndFace Method
Given a face, tell if it is an end cap face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEndFace(
	Reference faceReference
)
Public Function IsEndFace (
	faceReference As Reference
) As Boolean
public:
bool IsEndFace(
	Reference^ faceReference
)
member IsEndFace :
        faceReference : Reference -> bool
Parameters
faceReference Reference
The reference of the face to be checked.
Return Value
Boolean
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace